# Q2-AI-Pandas-Class-3(5-10-2019)

In [1]:
import pandas as pd

In [2]:
obj = pd.Series([10,11,12,13])

In [3]:
obj

0    10
1    11
2    12
3    13
dtype: int64

In [4]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj.values

array([10, 11, 12, 13], dtype=int64)

In [6]:
obj1 = pd.Series([13,25,56,85],index = ['a', 'b', 'c', 'd'])
obj1

a    13
b    25
c    56
d    85
dtype: int64

In [7]:
obj1['d']

85

In [8]:
obj1['c']=100

In [9]:
obj1

a     13
b     25
c    100
d     85
dtype: int64

In [10]:
del obj1['c']

In [11]:
obj1

a    13
b    25
d    85
dtype: int64

In [12]:
obj1['z']=100

In [13]:
obj1

a     13
b     25
d     85
z    100
dtype: int64

In [14]:
obj1.object

AttributeError: 'Series' object has no attribute 'object'

In [ ]:
ind=[1,2,3,4,5]

In [ ]:
obj2=pd.Series(['apple','orange','red','green','blue'], index=ind)

In [ ]:
obj2

In [ ]:
obj2[4]

In [ ]:
obj2[[3,5,1]]

In [ ]:
Series

In [ ]:
obj2=='banana'

In [ ]:
obj2[obj2=='orange']

In [ ]:
obj2[obj2=='banana']

In [ ]:
obj2 *2

In [ ]:
S1 = pd.Series([100,200,300,400,500],index=['1h','2h','3h','4h','5h'])

In [ ]:
'6h' in S1

In [ ]:
S1

In [ ]:
'1h' in S1

In [ ]:
##Creating a series using python dictionary

In [ ]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [ ]:
s2 = pd.Series(sdata)

In [ ]:
s2

In [ ]:
states = [ 'California','Ohio', 'Oregon', 'Texas']

In [ ]:
s2=pd.Series(sdata, index=states)

In [ ]:
s2

In [ ]:
pd.isnull(s2)

In [ ]:
pd.notnull(s2)

In [ ]:
s2[pd. notnull(s2)]

# Data Frames

In [85]:
data1 = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data1

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [86]:
df = pd.DataFrame(data1)

In [87]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [88]:
data=pd.DataFrame(df, columns=['year', 'state', 'pop'])
data

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [89]:
frame2 = pd.DataFrame(data1, columns=['year', 'state', 'pop', 'debt'],
       index=['one', 'two', 'three', 'four', 'five', 'six'])

In [90]:
frame2.index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [91]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [83]:
frame2.debt=100
#or frame2['debt']=100

In [25]:
frame2

       year state  pop  debt
one     NaN   NaN  NaN   100
two     NaN   NaN  NaN   100
three   NaN   NaN  NaN   100
four    NaN   NaN  NaN   100
five    NaN   NaN  NaN   100
six     NaN   NaN  NaN   100

In [26]:
frame2['debt']=[12,23,45,54,66,77]

In [27]:
frame2

       year state  pop  debt
one     NaN   NaN  NaN    12
two     NaN   NaN  NaN    23
three   NaN   NaN  NaN    45
four    NaN   NaN  NaN    54
five    NaN   NaN  NaN    66
six     NaN   NaN  NaN    77

In [28]:
frame2.debt=range(6)

In [29]:
frame2

       year state  pop  debt
one     NaN   NaN  NaN     0
two     NaN   NaN  NaN     1
three   NaN   NaN  NaN     2
four    NaN   NaN  NaN     3
five    NaN   NaN  NaN     4
six     NaN   NaN  NaN     5

In [32]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [33]:
frame2.year

one     NaN
two     NaN
three   NaN
four    NaN
five    NaN
six     NaN
Name: year, dtype: float64

In [34]:
frame2['year']

one     NaN
two     NaN
three   NaN
four    NaN
five    NaN
six     NaN
Name: year, dtype: float64

In [35]:
frame2[['year', 'state']]           #pass a list for more than 1 item

       year state
one     NaN   NaN
two     NaN   NaN
three   NaN   NaN
four    NaN   NaN
five    NaN   NaN
six     NaN   NaN

In [38]:
fr=frame2.loc['three'] 
fr
#gives record of index three

year     NaN
state    NaN
pop      NaN
debt       2
Name: three, dtype: object

In [39]:
frame2.iloc[3]           #integer index(however in our data indexing is not integer, 
                         #but it takes itself)

year     NaN
state    NaN
pop      NaN
debt       3
Name: four, dtype: object

In [40]:
fr

year     NaN
state    NaN
pop      NaN
debt       2
Name: three, dtype: object

In [41]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [42]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [43]:
frame2['debt'] =val

In [44]:
frame2

       year state  pop  debt
one     NaN   NaN  NaN   NaN
two     NaN   NaN  NaN  -1.2
three   NaN   NaN  NaN   NaN
four    NaN   NaN  NaN  -1.5
five    NaN   NaN  NaN  -1.7
six     NaN   NaN  NaN   NaN

In [45]:
frame2.debt['one', 'three', 'six']=[5, 10, 15]

E:\PYTHON\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
E:\PYTHON\lib\site-packages\pandas\core\indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [46]:
frame2

       year state  pop  debt
one     NaN   NaN  NaN   5.0
two     NaN   NaN  NaN  -1.2
three   NaN   NaN  NaN  10.0
four    NaN   NaN  NaN  -1.5
five    NaN   NaN  NaN  -1.7
six     NaN   NaN  NaN  15.0

In [47]:
frame2['eastern']=frame2.state=='Ohio'

In [48]:
frame2

       year state  pop  debt  eastern
one     NaN   NaN  NaN   5.0    False
two     NaN   NaN  NaN  -1.2    False
three   NaN   NaN  NaN  10.0    False
four    NaN   NaN  NaN  -1.5    False
five    NaN   NaN  NaN  -1.7    False
six     NaN   NaN  NaN  15.0    False

In [55]:
Score = {'python1':[23,45,43,36,65,47,76,54,43,23],
        'python2':[33,43,55,63,28,98,80,65,44,32],
        'AI' :[44,54,36,76,65,32,37,87,66,54]}

In [56]:
sc=pd.DataFrame(Score)

In [57]:
sc

   python1  python2  AI
0       23       33  44
1       45       43  54
2       43       55  36
3       36       63  76
4       65       28  65
5       47       98  32
6       76       80  37
7       54       65  87
8       43       44  66
9       23       32  54

In [58]:
sc.head()

   python1  python2  AI
0       23       33  44
1       45       43  54
2       43       55  36
3       36       63  76
4       65       28  65

In [59]:
sc.head(7)

   python1  python2  AI
0       23       33  44
1       45       43  54
2       43       55  36
3       36       63  76
4       65       28  65
5       47       98  32
6       76       80  37

In [77]:
sc=pd.DataFrame(Score, columns=['Department', 'python1', 'python2', 'AI','total'],
                   index=['Ali', 'Majid', 'Zee', 'Farhan', 'Saim', 'Hamza', 'Salim', 'Hasan', 'Asad', 'Saad'])

In [78]:
sc

       Department  python1  python2  AI total
Ali           NaN       23       33  44   NaN
Majid         NaN       45       43  54   NaN
Zee           NaN       43       55  36   NaN
Farhan        NaN       36       63  76   NaN
Saim          NaN       65       28  65   NaN
Hamza         NaN       47       98  32   NaN
Salim         NaN       76       80  37   NaN
Hasan         NaN       54       65  87   NaN
Asad          NaN       43       44  66   NaN
Saad          NaN       23       32  54   NaN

In [72]:
sc['total'] =sc.python1+sc.python2+sc['AI']

In [73]:
sc

        python1  python2  AI  total
Ali          23       33  44    100
Majid        45       43  54    142
Zee          43       55  36    134
Farhan       36       63  76    175
Saim         65       28  65    158
Hamza        47       98  32    177
Salim        76       80  37    193
Hasan        54       65  87    206
Asad         43       44  66    153
Saad         23       32  54    109

In [74]:
sc['status']=['pass' if i>=150 else ' fails' for i in sc.total]

In [75]:
sc

        python1  python2  AI  total  status
Ali          23       33  44    100   fails
Majid        45       43  54    142   fails
Zee          43       55  36    134   fails
Farhan       36       63  76    175    pass
Saim         65       28  65    158    pass
Hamza        47       98  32    177    pass
Salim        76       80  37    193    pass
Hasan        54       65  87    206    pass
Asad         43       44  66    153    pass
Saad         23       32  54    109   fails

In [76]:
sc['status']=['pass' np.where((sc['python1']>50) and (sc['python2']>50) and (sc['AI']>50)) else ' fail']

SyntaxError: invalid syntax (<ipython-input-76-0d1c0318f5b7>, line 1)

# Q2-AI-Pandas- Class-4(13-10-2019)

In [2]:
import pandas as pd
import numpy as np

In [2]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
             'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [3]:
frame3 = pd.DataFrame(pop)

In [4]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [5]:
frame3.T                         #Transpose

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [6]:
pd.DataFrame(frame3,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [7]:
data1 = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
data1

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [8]:
frame3=pd.DataFrame(pop )
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [9]:
frame3['Ohio'][:-1]          #or    a=frame3['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [10]:
frame3['Nevada'][:2]        #or    b=frame3['Nevada'][:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [11]:
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}    #slicing
#or      pdata = {'Ohio': a, 'Nevada': b}

In [12]:
pdata

{'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [13]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [14]:
frame3.index.name = 'year' ; frame3.columns.name = 'state'

In [15]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [16]:
frame3.values            #it gives only values from data frame

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

# Index Objects

In [23]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [28]:
obj

a    0
b    1
c    2
dtype: int64

In [24]:
index = obj.index

In [25]:
index

Index(['a', 'b', 'c'], dtype='object')

In [26]:
index[1:]

Index(['b', 'c'], dtype='object')

In [27]:
obj[1:]

b    1
c    2
dtype: int64

In [29]:
labels = pd.Index(np.arange(3))

In [30]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [31]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [32]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

# Reindexig

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [5]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [6]:
#ffill and bfill

In [7]:
obj3.reindex(range(6), method='ffill')      #"ffill" means forward fill
                                            # similarly "bfill" i.e backward fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [8]:
obj3.reindex(range(10), method='ffill')      #ffill means forward fill

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
6    yellow
7    yellow
8    yellow
9    yellow
dtype: object

In [9]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[1, 2, 4])
obj3

1      blue
2    purple
4    yellow
dtype: object

In [10]:
obj3.reindex(range(6), method='ffill')      #ffill means forward fill

0       NaN
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [11]:
obj3.reindex(range(6), method='bfill')

0      blue
1      blue
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [12]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
        index=['a', 'c', 'd'],
        columns=['Ohio', 'Texas', 'California'])
        
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [13]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [14]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [15]:
#loc and Drop

In [16]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [17]:
frame.loc[['a', 'b', 'c', 'd'], states]   #can reindex more succinctly by label-indexing
                                            #with loc,

E:\PYTHON\lib\site-packages\pandas\core\indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [18]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [19]:
new_obj = obj.drop('c')

In [20]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [21]:
obj.drop(['d', 'c'])           #delete entire rows

a    0.0
b    1.0
e    4.0
dtype: float64

In [22]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [23]:
obj.drop(['d', 'c'], inplace = True)    #inplace deletes obj permanently

In [24]:
obj

a    0.0
b    1.0
e    4.0
dtype: float64

In [25]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
           index=['Ohio', 'Colorado', 'Utah', 'New York'],
           columns=['one', 'two', 'three', 'four'])

In [26]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
data.drop('two', axis=1)        #can drop values from the columns by passing axis=1 or axis='columns'

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [29]:
data.drop('Utah', axis=0)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York   12   13     14    15

In [ ]:
# Indexing, Selection and Filtering

In [33]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [34]:
obj['b']                     #indexing

1.0

In [35]:
obj['b':'d']                #slicing

b    1.0
c    2.0
d    3.0
dtype: float64

In [41]:
obj5 = pd.Series(np.arange(5.), index=['1', '2', '3', '4', '5'])
obj5

1    0.0
2    1.0
3    2.0
4    3.0
5    4.0
dtype: float64

In [43]:
obj5['2':'4']

2    1.0
3    2.0
4    3.0
dtype: float64

In [37]:
obj[1:3]                  #slicing through default indexing, not the defined or manual indexing

b    1.0
c    2.0
dtype: float64

In [44]:
obj[12:48]                     #wrong slicing does not show error

Series([], dtype: float64)

In [45]:
obj['b','c']=5

In [46]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
e    4.0
dtype: float64

In [47]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
           index=['Ohio', 'Colorado', 'Utah', 'New York'],
           columns=['one', 'two', 'three', 'four'])

In [48]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [51]:
data.iloc[2, [3,0,1]]           #second row and values of column 3,0 and 1

four    11
one      8
two      9
Name: Utah, dtype: int32

In [2]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [3]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
      index=['a', 'c', 'e', 'f', 'g'])

In [4]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [5]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [6]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [7]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
      index=['Ohio', 'Texas', 'Colorado'])
#columns=list('bcd'), it runs a loop in 'bcd' to separate them

In [8]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
      index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [66]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [9]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [10]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [11]:
df1 = pd.DataFrame({'A': [1, 2]})

In [12]:
 df2 = pd.DataFrame({'B': [3, 4]})

In [13]:
df1

   A
0  1
1  2

In [14]:
df2

   B
0  3
1  4

In [15]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

# Arithmetic Method with Fill Values

In [16]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
      columns=list('abcd'))

In [17]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
      columns=list('abcde'))

In [18]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [29]:
df2.loc[1, 'b'] = np.nan

In [30]:
df2

      a    b     c     d     e
0   0.0    1   2.0   3.0   4.0
1   5.0  NaN   7.0   8.0   9.0
2  10.0   11  12.0  13.0  14.0
3  15.0   16  17.0  18.0  19.0

In [34]:
df1+df2

      a    b     c     d   e
0   0.0    2   4.0   6.0 NaN
1   9.0  NaN  13.0  15.0 NaN
2  18.0   20  22.0  24.0 NaN
3   NaN  NaN   NaN   NaN NaN

In [35]:
df1.add(df2, fill_value=0)  # fill_value=0 takes zero value for 'NaN', then adds

      a   b     c     d     e
0   0.0   2   4.0   6.0   4.0
1   9.0   5  13.0  15.0   9.0
2  18.0  20  22.0  24.0  14.0
3  15.0  16  17.0  18.0  19.0

In [33]:
df1.add(df2, fill_value=1)

      a   b     c     d     e
0   0.0   2   4.0   6.0   5.0
1   9.0   6  13.0  15.0  10.0
2  18.0  20  22.0  24.0  15.0
3  16.0  17  18.0  19.0  20.0

In [36]:
df1.rdiv()

TypeError: f() missing 1 required positional argument: 'other'

# BROADCAST

In [41]:
arr = np.arange(12.).reshape((3, 4))

In [42]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [43]:
arr[0]

array([0., 1., 2., 3.])

In [44]:
arr-arr[0]         #arr[0] broadcasts itself or it repeats itself to make its order same as that of 'arr'
                  #i.e arr[0] = [0,1,2,3
                   #              0,1,2,3
                   #             0,1,2,3]  # then subtracts

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

# Function Application and Mapping

In [46]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
        index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [47]:
frame

               b         d         e
Utah    0.094545 -0.286228 -0.471762
Ohio   -0.491616  0.250436  0.459478
Texas   0.273829 -1.492382 -0.349080
Oregon -0.256468 -0.450537  1.375179

In [48]:
np.abs(frame)           #absolute value(removes negative signs)

               b         d         e
Utah    0.094545  0.286228  0.471762
Ohio    0.491616  0.250436  0.459478
Texas   0.273829  1.492382  0.349080
Oregon  0.256468  0.450537  1.375179

# Lambda

In [49]:
f = lambda x : x*100        #lambda is unanimous function
f(2)

200

In [50]:
f = lambda x: x.max() - x.min()

In [51]:
frame.apply(f)           #apply works on columns

b    0.765445
d    1.742818
e    1.846940
dtype: float64

In [54]:
frame['b'].applymap(f)        #it does not take value of only single column

AttributeError: 'Series' object has no attribute 'applymap'

In [55]:
frame.apply(f, axis='columns')

Utah      0.566306
Ohio      0.951094
Texas     1.766211
Oregon    1.825716
dtype: float64

In [56]:
frame.apply(f, axis='rows')

b    0.765445
d    1.742818
e    1.846940
dtype: float64

In [57]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [58]:
frame.apply(f)

            b         d         e
min -0.491616 -1.492382 -0.471762
max  0.273829  0.250436  1.375179

# Q2-AI-Pandas-Class-5(19-10-2019)

In [1]:
import numpy as np

In [2]:
import pandas as pd

# Sorting and Ranking

In [3]:
obj = pd.Series(range(4), index=['d','a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [4]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [5]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d', 'a','b', 'c'])

In [6]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [7]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [8]:
obj=pd.Series([4,7,-3,2])

In [9]:
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [10]:
frame=pd.DataFrame({'b':[4,7,-3,2], 'a':[1,2,3,4]})

In [11]:
frame

   b  a
0  4  1
1  7  2
2 -3  3
3  2  4

In [12]:
frame.sort_values(by='b')

   b  a
2 -3  3
3  2  4
0  4  1
1  7  2

In [13]:
frame.sort_values(by=['a', 'b'])

   b  a
0  4  1
1  7  2
2 -3  3
3  2  4

In [14]:
obj= pd.Series([7,-5,7,4,2,0,4])

In [15]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [16]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [17]:
frame.sort_index(axis=1, ascending=False)

   b  a
0  4  1
1  7  2
2 -3  3
3  2  4

In [18]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [19]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [20]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [21]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [22]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
       'c': [-2, 5, 8, -2.5]})

In [23]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [24]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [25]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [26]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [27]:
obj.index.is_unique

False

In [28]:
obj['a']

a    0
a    1
dtype: int64

In [29]:
obj['c']

4

In [30]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.417266  0.538332  0.367658
a  0.838670 -1.490914 -0.743421
b  0.087827 -0.386967 -1.613795
b  0.668851  0.904758 -0.094189

In [31]:
df.loc['b']

          0         1         2
b  0.087827 -0.386967 -1.613795
b  0.668851  0.904758 -0.094189

In [32]:
df

          0         1         2
a  0.417266  0.538332  0.367658
a  0.838670 -1.490914 -0.743421
b  0.087827 -0.386967 -1.613795
b  0.668851  0.904758 -0.094189

In [39]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                 index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [40]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [41]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [42]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [43]:
df.sum(axis='columns', skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [44]:
df.idxmax()

one    b
two    d
dtype: object

In [45]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [46]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [47]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [48]:
obj.rank()

a    1.0
a    2.0
b    3.0
b    4.0
c    5.0
dtype: float64

In [50]:
df.mean(axis='columns', skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

# Covariance and Correlation

In [53]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
 for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

ConnectionError: HTTPSConnectionPool(host='finance.yahoo.com', port=443): Max retries exceeded with url: /quote/AAPL/history?period1=1418598000&period2=1576364399&interval=1d&frequency=1d&filter=history (Caused by NewConnectionError('<urllib3.connection.VerifiedHTTPSConnection object at 0x00000000094B60F0>: Failed to establish a new connection: [Errno 11004] getaddrinfo failed'))

In [55]:
import pandas_datareader.data as web

# Q2-AI-Pandas-Class-6(2-11-2019)

In [56]:
import numpy as np
import pandas as pd

In [57]:
import os
a = os.listdir('.')
a

['.anaconda',
 '.bash_history',
 '.conda',
 '.condarc',
 '.gitconfig',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.matplotlib',
 '.viminfo',
 'abc.csv.ods',
 'AppData',
 'Application Data',
 'Book1.csv',
 'class-vii,1-6-2019,for loop, nested loop.ipynb',
 'Contacts',
 'Cookies',
 'Desktop',
 'Documents',
 'Downloads',
 'Dropbox',
 'Favorites',
 'import_csv_file(20-7-2019).ipynb',
 'Links',
 'list-insert-append-pop etc.ipynb',
 'Local Settings',
 'Music',
 'My Documents',
 'mydata.sqlite',
 'myMath.py',
 'myName.py',
 'NetHood',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{016888bd-6c6f-11de-8d1d-001e0bcde3ec}.TM.blf',
 'NTUSER.DAT{016888bd-6c6f-11de-8d1d-001e0bcde3ec}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{016888bd-6c6f-11de-8d1d-001e0bcde3ec}.TMContainer00000000000000000002.regtrans-ms',
 'NTUSER.DAT{6cd5062d-1054-11e9-b659-00271015b704}.TM.blf',
 'NTUSER.DAT{6cd5062d-1054-11e9-b659-00271015b704}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{6cd5062d-1054-11e9-b659-00271015b704}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'Pictures',
 'PrintHood',
 'product.csv',
 'Python',
 'Q2-AI-ClassWork-NumPy.ipynb',
 'Q2-Class-Work-Pandas.ipynb',
 'Recent',
 'Saved Games',
 'Searches',
 'SendTo',
 'slicing.ipynb',
 'some_array.npy',
 'Start Menu',
 'TAXRATES1.csv',
 'Templates',
 'tendorflow deep learning.ipynb',
 'tuples.ipynb',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'Untitled2.ipynb',
 'Untitled3.ipynb',
 'Untitled5.ipynb',
 'Untitled6.ipynb',
 'Untitled7.ipynb',
 'Untitled8.ipynb',
 'Videos']

In [58]:
import pandas as pd

In [59]:
import csv

In [60]:
data = pd.read_csv('TAXRATES1.csv')
data

,Unnamed: 0,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0,0,AK,one,ANCHORAGE BOROUGH,0.0,0.0,0.0,NaN,0.0,1
1,1,AK,one,ANCHORAGE BOROUGH,0.0,NaN,0.0,0.0,0.0,2
2,2,AK,two,ANCHORAGE BOROUGH,0.0,0.0,NaN,0.0,NaN,3
3,3,AK,two,ANCHORAGE BOROUGH,NaN,0.0,0.0,0.0,0.0,4

In [61]:
import csv
# For any file with a single-character delimiter, you can use Pythons built-in csv module.
# To use it, pass any open file or file-like object to csv.reader:
f = open('TAXRATES1.csv')
reader = csv.reader(f)
# reader = list(csv.reader(f)) # Without loop
reader

In [62]:
import csv
# For any file with a single-character delimiter, you can use Pythons built-in csv module.
# To use it, pass any open file or file-like object to csv.reader:
f = open('TAXRATES1.csv')
reader = csv.reader(f)
# reader = list(csv.reader(f)) # Without loop
reader

In [63]:
for line in reader:
    print(line)           #prints each line separately

['', 'State', 'ZipCode', 'TaxRegionName', 'StateRate', 'EstimatedCombinedRate', 'EstimatedCountyRate', 'EstimatedCityRate', 'EstimatedSpecialRate', 'RiskLevel']
['0', 'AK', 'one', 'ANCHORAGE BOROUGH', '0', '0', '0', '', '0', '1']
['1', 'AK', 'one', 'ANCHORAGE BOROUGH', '0', '', '0', '0', '0', '2']
['2', 'AK', 'two', 'ANCHORAGE BOROUGH', '0', '0', '', '0', '', '3']
['3', 'AK', 'two', 'ANCHORAGE BOROUGH', '', '0', '0', '0', '0', '4']

In [65]:
with open('TAXRATES1.csv') as f:
    lines = list(csv.reader(f))
lines                               #through List, result is in two dimension list

[['',
  'State',
  'ZipCode',
  'TaxRegionName',
  'StateRate',
  'EstimatedCombinedRate',
  'EstimatedCountyRate',
  'EstimatedCityRate',
  'EstimatedSpecialRate',
  'RiskLevel'],
 ['0', 'AK', 'one', 'ANCHORAGE BOROUGH', '0', '0', '0', '', '0', '1'],
 ['1', 'AK', 'one', 'ANCHORAGE BOROUGH', '0', '', '0', '0', '0', '2'],
 ['2', 'AK', 'two', 'ANCHORAGE BOROUGH', '0', '0', '', '0', '', '3'],
 ['3', 'AK', 'two', 'ANCHORAGE BOROUGH', '', '0', '0', '0', '0', '4']]

In [66]:
header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'': ('0', '1', '2', '3'),
 'State': ('AK', 'AK', 'AK', 'AK'),
 'ZipCode': ('one', 'one', 'two', 'two'),
 'TaxRegionName': ('ANCHORAGE BOROUGH',
  'ANCHORAGE BOROUGH',
  'ANCHORAGE BOROUGH',
  'ANCHORAGE BOROUGH'),
 'StateRate': ('0', '0', '0', ''),
 'EstimatedCombinedRate': ('0', '', '0', '0'),
 'EstimatedCountyRate': ('0', '0', '', '0'),
 'EstimatedCityRate': ('', '0', '0', '0'),
 'EstimatedSpecialRate': ('0', '0', '', '0'),
 'RiskLevel': ('1', '2', '3', '4')}

In [ ]:
a=[1,2,3]         #packing

In [ ]:
x,y,z=a           #unpacking
print(x,y,z)

In [ ]:
df = pd.read_csv("TAXRATES1.csv")

In [ ]:
df

In [ ]:
header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

In [ ]:
import pandas_datareader.data as web

# JSON DATA|

In [ ]:
import json

In [ ]:
obj = """{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"],
 "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
 {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}"""

In [ ]:
result = json.loads(obj)   #To convert a JSON string to Python form, use json.loads:

In [ ]:
result

In [ ]:
asjson = json.dumps(result)   #json.dumps, on the other hand, converts a Python object back to JSON:

In [ ]:
result = json.loads(obj)
result

In [ ]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

In [ ]:
htmlReader = pd.read_html('index.html')

# INTERACTING WITH Web API's

In [ ]:
import requests

In [ ]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)

In [ ]:
data = resp.json()
data

In [ ]:
data[0]['title']

In [ ]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])
issues

# Interacting with Databases

In [ ]:
import sqlite3
query = """
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20),
    c REAL, d INTEGER);"""

In [ ]:
print(query)

In [ ]:
con = sqlite3.connect('mydata.sqlite')

In [ ]:
con.execute(query)

In [ ]:
con.commit()

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
('Tallahassee', 'Florida', 2.6, 3),
('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

# HTML - Beautiful Soup

In [ ]:
import bs4

In [ ]:
from urllib.request import urlopen as uReq
from urllib.request import Request
from bs4 import BeautifulSoup as soup

In [ ]:
my_url = 'https://'

In [ ]:
uClient = uReq(my_url)

In [ ]:
page_html = uClient.read()

In [ ]:
uClient.close()

In [ ]:
page_html

In [ ]:
page_soup = soup(page_html, "html.parser")

In [ ]:
page_soup

In [ ]:
page_soup.h1   #it brings main heading from html

In [ ]:
page_soup.p     #it brings paragraph from html

In [ ]:
container = page_soup.find_all("div", {"class" : "item-container"})

In [ ]:
container

In [ ]:
len(container)

In [ ]:
contain = container[0]

In [ ]:
contain

In [ ]:
contain.a

In [ ]:
contain.img['title']

In [ ]:
filename = "product.csv"
f = open (filename, "w")
header = "brand, product_name, shopping\n"
f.write(header)

# Q2-AI-Pandas-Class-7(9-11-2019)

In [ ]:
import bs4

In [ ]:
from urllib.request import urlopen as uReq
from urllib.request import Request
from bs4 import BeautifulSoup as soup

In [ ]:
my_url = 'https://www.newegg.com/Laptops-Notebooks/Category/ID-223'

In [ ]:
uClient = uReq(my_url)

In [ ]:
page_html = uClient.read()

In [ ]:
uClient.close()

In [ ]:
page_soup = soup(page_html, 'html.parser')

In [ ]:
page_soup

# Filtering Out Missing Data

In [ ]:
import numpy as np
from numpy import nan as NA
import pandas as pd

In [ ]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [ ]:
data.dropna()

In [ ]:
data[data.notnull()]

In [ ]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [ ]:
cleaned = data.dropna()

In [ ]:
data

In [ ]:
cleaned

In [ ]:
 data.dropna(how='all')

In [ ]:
data[4] = NA

In [ ]:
data

In [ ]:
data.dropna(axis=1, how='all')

In [ ]:
 df = pd.DataFrame(np.random.randn(7, 3))

In [ ]:
df.iloc[:4, 1] = NA

In [ ]:
df.iloc[:2, 2] = NA

In [ ]:
df

In [ ]:
df.dropna()

In [ ]:
df.dropna(thresh=2)    #threshold outs rows having less than three NAN values

# Filling In Missing Data

In [ ]:
df.fillna({1: 0.5, 2:0})

In [ ]:
 _ = df.fillna(0, inplace=True)

In [ ]:
df

In [ ]:
df = pd.DataFrame(np.random.randn(6, 3))

In [ ]:
 df.iloc[2:, 1] = NA

In [ ]:
df.iloc[4:, 2] = NA

In [ ]:
df

In [ ]:
df.fillna(method='ffill')

In [15]:
df.fillna(method='ffill', limit=2)

NameError: name 'df' is not defined

In [ ]:
 data = pd.Series([1., NA, 3.5, NA, 7])

In [ ]:
data.fillna(data.mean())

# Removing Duplicates

In [ ]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

In [ ]:
data

In [ ]:
data.duplicated()  # boolean Series indicating whether each
                   #row is a duplicate (has been observed in a previous row) or not

In [ ]:
data.drop_duplicates()

In [ ]:
 data['v1'] = range(7)

In [ ]:
 data.drop_duplicates(['k1'])

In [ ]:
data.drop_duplicates(['k1', 'k2'], keep='last')

# Transforming Data Using a Function or Mapping

In [ ]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                                'Pastrami', 'corned beef', 'Bacon',
                                'pastrami', 'honey ham', 'nova lox'],
                                'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [ ]:
data

In [ ]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}

In [ ]:
lowercased = data['food'].str.lower()

In [ ]:
lowercased

In [ ]:
 data['animal'] = lowercased.map(meat_to_animal)

In [ ]:
data

In [16]:
 data['food'].map(lambda x: meat_to_animal[x.lower()])

NameError: name 'data' is not defined

# Replacing Values

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [ ]:
data

In [ ]:
data.replace(-999, np.nan)

In [ ]:
 data.replace([-999, -1000], np.nan)

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

In [ ]:
data.replace({-999: np.nan, -1000: 0})

# Renaming Axis Indexes

In [ ]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [ ]:
transform = lambda x: x[:4].upper()

In [ ]:
data.index.map(transform)

In [ ]:
Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [ ]:
data.index = data.index.map(transform)

In [ ]:
data

In [ ]:
data.rename(index=str.title, columns=str.upper)

In [17]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

NameError: name 'data' is not defined

In [ ]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [ ]:
data

# Q2-AI-Pandas-Class-8(16-11-2019)    missed

# Q2-AI-Deep Learning With Python-Class-9(23-11-2019)

In [1]:
from keras.datasets import mnist

ModuleNotFoundError: No module named 'keras'

# Q2-AI-Deep Learning With Python-Class-10(30-11-2019)

# Q2-AI-Deep Learning With Python-Class-11(07-12-2019)

# Q2-AI-Deep Learning With Python-Class-12(14-12-2019)

In [2]:
import tensorflow as tf|

SyntaxError: invalid syntax (<ipython-input-2-f49d2bade277>, line 1)

# Example of Fashion MNIST

In [3]:
import tensorflow as tf
class myCallback(tf.keras.callbacks.Callback):
    def on_epoch_end(self, epoch, logs={}):
        if(logs.get('acc')>0.9):
            pring("\nReached 90% accuracy so cancelling training!")
            self.model.stop_training=True

ModuleNotFoundError: No module named 'tensorflow'

In [4]:
mnist = tf.keras.datasets.fashion_mnist
(x_train, y_train) , (x_test, y_test) = mnist.load_data()
x_train, x_test = x_train / 255.0, x_test / 255.0

NameError: name 'tf' is not defined

In [5]:
callbacks = myCallback()

NameError: name 'myCallback' is not defined

In [6]:
model = tf.keras.models.sequentials([
            tf.keras.layers.Flatten(input_shape=(28, 28)),
            tf.keras.layers.Dense(512, activation=tf.nn.relu),
            tf.keras.layers.Dense(10, activation=tf.nn.softmax)
    
])
model.compile(optimizer='adam',
            loss='sparse_categorical_crossentropy',
            metrics=['accuracy'])

NameError: name 'tf' is not defined

In [7]:
model.fit(x_train, y_train, epochs=10, callbacks=[mycallbacks])

NameError: name 'model' is not defined

# Movie Review from IMBD

In [1]:
from keras.datasets import imdb

ModuleNotFoundError: No module named 'keras'

In [2]:
(train_data, train_labels), (test_data, test_labels) = imdb.load_data(
num_words=10000)

NameError: name 'imdb' is not defined

In [3]:
train_data[0]

NameError: name 'train_data' is not defined

In [5]:
 train_labels[0]

NameError: name 'train_labels' is not defined

In [6]:
import numpy as np
def vectorize_sequences(sequences, dimension=10000):
results = np.zeros((len(sequences), dimension))
for i, sequence in enumerate(sequences):
results[i, sequence] = 1.
return results

IndentationError: expected an indented block (<ipython-input-6-25fa0878ebb6>, line 3)

In [7]:
x_train = vectorize_sequences(train_data)
x_test = vectorize_sequences(test_data)

NameError: name 'vectorize_sequences' is not defined